{

"siteName": "Books. Modern Developer",

"books": [

{
  "title": "Eloquent Javascript: A Modern Introduction to Programming",
  "authorName": "Marijn Haverbeke",
  "authorLink": "",
  "authorTwitter": "",
  "publicationYear": "2015",
  "edition": "2nd",
  "abstract": "JavaScript lies at the heart of almost every modern web application, from social apps to the newest browser-based games. Though simple for beginners to pisk up and play with, JavaScript is a flexible, complex language that you can use to build full-scale applications. Eloquent JavaScript, 2nd Edition dives deep into the JavaScript language to show you how to write beautiful, effective code.",
  "bookCoverImg": "/link/to/image",

  "priceGumRoad": "$28.40",
  "priceAmazon": "$29.65",
  "priceManning": "$28.70",

  "linkDownload": "/link/to/download",

  "ratingEasyToFollow": "29",
  "ratingComprehensiveness": "06",
  "ratingExamples": "18"

  },
  {
  "title": "JavaScript and JQuery: Interactive Front-End Web Development",
  "authorName": "Marijn Haverbeke",
  "authorLink": "",
  "authorTwitter": "",
  "publicationYear": "2016",
  "edition": "1st",
  "abstract": "In JavaScript & jQuery renowned author Jon Duckett discards the traditional programming book template and approaches writing code in a more relevant, less intimidating way.Full-color and packed with instructional graphics and photos, his books have gained a loyal following by illustrating programming in a way both instructive for newcomers and invaluable for seasoned coders.",
  "bookCoverImg": "/link/to/image",

  "priceGumRoad": "",
  "priceAmazon": "",
  "priceManning": "",

  "linkDownload": "/link/to/download",

  "ratingEasyToFollow": "29",
  "ratingComprehensiveness": "06",
  "ratingExamples": "18"

  },
  {
  "title": "Learning PHP, MySQL & JavaScript: With jQuery,CSS & HTML5",
  "authorName": "Marijn Haverbeke",
  "authorLink": "",
  "authorTwitter": "",
  "publicationYear": "2016",
  "edition": "4th",
  "abstract": "Build interactive, data-driven websites with the potent combination of open-source technologies and web standards, even if you have only basic HTML knowledge. With this popular hands-on guide, you'll tackle dynamic web programming with the help of today's core technologies: PHP, MySQL, JavaScript, jQuery, CSS, and HTML5. By discussing JavaScript and jQuery in a single text, Duckett ensures you will quickly be writing your own.",
  "bookCoverImg": "/link/to/image",

  "priceGumRoad": "$28.40",
  "priceAmazon": "$29.65",
  "priceManning": "$28.70",

  "linkDownload": "/link/to/download",

  "ratingEasyToFollow": "29",
  "ratingComprehensiveness": "06",
  "ratingExamples": "18"

  }
]

}
